{
    "bandages": {
        "name": "Bandages",
        "description": "BASIC: 2 points\tCrew members you revive get an additional 15% health.\nACE: 4 points\tYou get an additional 20% health after being revived.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "support",
        "tree": "mastermind"
    },
    "company_soul": {
        "name": "Company Soul",
        "description": "BASIC: 1 point\tCrew members you revive take 10% less damage for 5 seconds and get an additional 5% health.\nACE: 3 points\tYou and your crew's stamina is increased by 50%.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "support",
        "tree": "mastermind"
    },
    "painkillers": {
        "name": "Painkillers",
        "description": "BASIC: 2 points\tCrew members you revive take an additional 40% less damage for 5 seconds.\nACE: 4 points\tYou take 50% less damage for 5 seconds after being revived.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "support",
        "tree": "mastermind"
    },
	"keepers": {
		"name": "Keepers",
		"description": "BASIC: 3 points\tYou can now deploy 2 Doctor Bags instead of just one.\nACE: 6 points\tYour doctor bags have 1 more charge.",
		"basic": 3,
		"ace": 6,
		"tier": 3,
		"subtree": "support",
		"tree": "mastermind"
	},
    "combat_doctor": {
        "name": "Combat Doctor",
        "description": "BASIC: 3 points\tYou gain a 40% damage reduction for 5 seconds both after and during revivng a teammate.\nACE: 6 points\tUpon reviving a crew member you gain a 25% damage bonus for 10 seconds.\nYou revive crew members 33% faster.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "support",
        "tree": "mastermind"
    },
    "inspire": {
        "name": "Inspire",
        "description": "BASIC: 4 points\tShouting at your teammates within a 7m range will increase their movement and reload speed by 30% for 7 seconds.\nACE: 8 points\tYou can now revive your teammates within a 7m range by shouting at them. This cannot occur more than once every 120 seconds.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "support",
        "tree": "mastermind"
    },
    "forced_friendship": {
        "name": "Forced Friendship",
        "description": "BASIC: 1 point\tIncrease your supply of cable ties by 4.\nYou can now cable tie hostages 25% faster.\nACE: 3 points\tYou can now have an additional hostage following you at the same time.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "controller",
        "tree": "mastermind"
    },
    "hostage_situation": {
        "name": "Hostage Situation",
        "description": "BASIC: 3 points\tTrading a hostage for resources will now restore the equivalent of 4 ammo box pickups into the reserves of every player in your team.\nYou can now trade for resources regardless of whether your team is missing any downs.\nACE: 6 points\tTrading a hostage for resources will now delay the incoming assault by 10 seconds. This effect is doubled for solo players.\nYou can now trade hostages for resources before the first assault.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "controller",
        "tree": "mastermind"
    },
    "joker": {
        "name": "Joker",
        "description": "BASIC: 2 points\tYou can now convert a non-special enemy to fight on your side.\nYour converted enemy deals 35% more damage and takes 50% less damage.\nACE: 4 points\tYour converted enemy now takes an additional 25% less damage.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "controller",
        "tree": "mastermind"
    },
    "control_freak": {
        "name": "Control Freak",
        "description": "BASIC: 2 points\tThe power and range of your intimidation is increased by 50%\nACE: 4 points\tCivilians are intimidated by the noise you make and remain intimidated 50% longer.\nNearby untied civilians have a chance of reviving you if you interact with them.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "controller",
        "tree": "mastermind"
    },
    "partners_in_crime": {
        "name": "Partners in Crime",
        "description": "BASIC: 3 points\tYour converted enemy is 15% more likely to be targeted when close to you or your crew.\nACE: 6 points\tYour converted enemy counts towards hostage related bonuses.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "controller",
        "tree": "mastermind"
    },
    "hostage_taker": {
        "name": "Hostage Taker",
        "description": "BASIC: 4 points\tYou regenerate up to 8 health every 5 seconds for having at least 1 hostage.\nHealth regenerated is divided by the amount of hostages equivalent to the team's size.\nACE: 8 points\tThe amount of health you regenerate is increased by 50% when you are within 7m of a hostage.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "controller",
        "tree": "mastermind"
    },
    "stable_shot": {
        "name": "Stable Shot",
        "description": "BASIC: 1 point\tYour weapons gain 4 accuracy.\nACE: 3 points\tThe time it takes for your aim to recenter after your last shot is reduced by 50%.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "sharpshooter",
        "tree": "mastermind"
    },
    "rifleman": {
        "name": "Rifleman",
        "description": "BASIC: 2 points\tYou snap to zoom 25% faster.\nACE: 4 points\tYour weapons are 20% more accurate while standing still.",
        "vr_description": "Addition in VR:\tBASIC: Every kill while aiming down sight will regenerate 2% stamina.\tEvery 25 points of stamina consumed by dashing will refill 5% of their ammo pool to single shot weapons.\tACE: The improved accuracy lasts from 1 up to a maximum of 5 seconds after dashing.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "sharpshooter",
        "tree": "mastermind"
    },
    "marksman": {
        "name": "Marksman",
        "description": "BASIC: 2 points\tYour aimpunch is reduced by 20% when aiming down sights.\nACE: 4 points\tYour weapon recoil is reduced by 20% while aiming down sights.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "sharpshooter",
        "tree": "mastermind"
    },
    "ammo_efficiency": {
        "name": "Ammo Efficiency",
        "description": "BASIC: 3 points\tGetting 3 headshots in less than 6 seconds will refund 1 bullet to your used weapon. Can only be triggered by SMGs, Assault Rifles and Sniper Rifles fired in single shot fire mode.\nACE: 6 points\tThe amount of headshots required is reduced to 2.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "sharpshooter",
        "tree": "mastermind"
    },
    "kilmer": {
        "name": "Kilmer",
        "description": "BASIC: 3 points\tYou reload your Sniper and Assault Rifles 25% faster.\nACE: 6 points\tAny killing headshot will increase your reload speed by 40% for 6 seconds. Can only be triggered by SMGs, Assault Rifles and Sniper Rifles fired in single shot fire mode.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "sharpshooter",
        "tree": "mastermind"
    },
    "headshot_fury": {
        "name": "Headshot Fury",
        "description": "BASIC: 4 points\tFor every consecutive headshot with your Sniper Rifle, your next shot's damage is increased by 20%.\tStacks up to 5 consecutive headshots.\nMissing a headshot resets your stacks.\nACE: 8 points\tWhile aiming down the sights with your Sniper Rifle, a charge meter builds up over a period of 3 seconds. When fully charged, your next headshot becomes explosive, dealing up to 100% of the bullet's damage in a 5m radius around the bullet impact and discharging the meter.\nLeaving the ADS stance or firing the weapon during the charging process resets the meter.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "sharpshooter",
        "tree": "mastermind"
    },
    "fast_hands": {
        "name": "Fast Hands",
        "description": "BASIC: 2 points\tYou reload Individually-Loaded Shotguns 25% faster.\nACE: 4 points\tYour rate of fire is increased by 25% while firing from the hip with single-shot Shotguns.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "shotgunner",
        "tree": "enforcer"
    },
    "mag_fed_specialist": {
        "name": "Mag-fed Specialist",
        "description": "BASIC: 3 points\tYou reload Mag-fed & Double Barrel Shotguns 25% faster.\nACE: 6 points\tYour Mag-fed Shotguns have their magazine size increased by 5 shells.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "shotgunner",
        "tree": "enforcer"
    },
    "shotgun_rampage": {
        "name": "Shotgun Rampage",
        "description": "BASIC: 4 points\tFor every kill with a Shotgun, you gain a 6% movement speed boost that lasts for 5 seconds.\tStacks up to 5 times.\nACE: 8 points\tWhen killing an enemy with a shotgun, you have a 75% chance to cause nearby enemies to panic.\tPanic will make enemies go into short bursts of uncontrollable fear.\nThis cannot occur more than once every 5 seconds.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "shotgunner",
        "tree": "enforcer"
    },
    "resilience": {
        "name": "Resilience",
        "description": "BASIC: 1 point\tIncreases your armor recovery rate by 10%.\nACE: 3 points\tReduces the visual effect duration of Flashbangs by 50%.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "tank",
        "tree": "enforcer"
    },
    "thick_skin": {
        "name": "Thick Skin",
        "description": "BASIC: 3 points\tYou gain 10% extra health.\nACE: 6 points\tYou gain an additional 20% extra health.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "tank",
        "tree": "enforcer",
		"stats": {
			"basic": [
				{
					"id": 100,
					"type": "health",
					"part": "healthBonus",
					"value": 0.1
				}
			],
			"ace": [
				{
					"id": 101,
					"type": "health",
					"part": "healthBonus",
					"value": 0.2
				}
			]
		}
    },
    "plates_of_steel": {
        "name": "Plates of Steel",
        "description": "BASIC: 2 points\tYour steadiness is increased by 15.\tHigher steadiness reduces aimpunch.\nACE: 4 points\tIncreases the armor of all ballistic vests by 20.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "tank",
        "tree": "enforcer",
        "stats": {
            "ace": [
                {
                    "id": 1,
                    "type": "armor",
                    "part": "armMod",
                    "value": 20,
                    "whitelist": ["light_ballistic", "ballistic", "heavy_ballistic"]
                }    
            ]
        }
    },
    "underdog": {
        "name": "Underdog",
        "description": "BASIC: 1 points\tWhen three or more enemies within 18 meters are targeting you, you receive a 15% damage bonus that lasts for 7 seconds.\nACE: 3 points\tWhen three or more enemies within 18 meters are targeting you, you also receive a 10% damage reduction that lasts for 7 seconds.\nNote: Does not apply to melee damage, throwables, grenade launchers or rocket launchers.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "shotgunner",
        "tree": "enforcer"
    },
    "pack_mule": {
        "name": "Pack Mule",
        "description": "BASIC: 2 points\tYou can now sprint with all bags.\nACE: 4 points\tYou can now carry 2 bags at the same time.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "tank",
        "tree": "enforcer"
    },
    "wip3": {
        "name": "Work in Progress",
        "description": "BASIC: 3 points\tWork in progress.\nACE: 6 points\tWork in progress.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "tank",
        "tree": "enforcer"
    },
    "iron_man": {
        "name": "Iron Man",
        "description": "BASIC: 4 points\tWhen you melee shield enemies, they get knocked back by the sheer force.\tYour ranged weapons have a chance of knocking down shields as well.\nACE: 8 points\tUnlocks the Improved Combined Tactical Vest for you to wear.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "tank",
        "tree": "enforcer",
        "stats": {
            "basic": [
                {
                    "id": 104,
                    "type": "armor",
                    "part": "armBonus",
                    "value": 0.3
                }    
            ]
        },
        "unlocks": [
            { "type": "armor", "name": "ictv", "whenState": 2 }
        ]
    },
    "scavenger": {
        "name": "Scavenger",
        "description": "BASIC: 1 point\tYour ammo pickup rate is increased by 5%.\nACE: 3 points\tYour ammo pick up range is increased by 20%.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "ammo_specialist",
        "tree": "enforcer"
    },
    "bulletstorm": {
        "name": "Bulletstorm",
        "description": "BASIC: 4 points\tAmmo bags placed by you grant players the ability to shoot without depleting their ammunition for up to 12 seconds after interacting with it. The more ammo players replenish, the longer the duration of the effect.\nACE: 8 points\tIncreases the base duration of the effect by up to 30 seconds.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "ammo_specialist",
        "tree": "enforcer"
    },
    "portable_saw": {
        "name": "Portable Saw",
        "description": "BASIC: 2 points\tUnlocks the OVE9000 portable saw for you to use as a secondary weapon.\nACE: 4 points\tYou gain 1 extra saw blade for the OVE9000 portable saw. You replace your saw blades with carbon blades, increasing your saw efficiency by 60%.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "shotgunner",
        "tree": "enforcer"
    },
    "saw_massacre": {
        "name": "Saw Massacre",
        "description": "BASIC: 2 points\tThe weardown of the saw blades on enemies is reduced by 90%.\nACE: 4 points\tYou can now saw through shield enemies with your OVE9000 portable saw. When killing an enemy with the saw, you have a 50% chance to cause nearby enemies in a 10m radius to panic.\tPanic will make enemies go into short bursts of uncontrollable fear.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "shotgunner",
        "tree": "enforcer"
    },
    "extra_lead": {
        "name": "Extra Lead",
        "description": "BASIC: 3 points\tYou can now place 2 ammo bags instead of just one.\nACE: 6 points\tEach ammo bag now contains 50% more ammunition.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "ammo_specialist",
        "tree": "enforcer"
    },
    "mag_plus": {
        "name": "Mag Plus",
        "description": "BASIC: 2 points\tFiring a weapon has a 5% chance to not consume any ammo.\nACE: 4 points\tYour weapons gain 20% more rounds in their magazine.\nNote: Does not affect the Aced \"Sleight of Hand\" Skill.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "ammo_specialist",
        "tree": "enforcer"
    },
    "fully_loaded": {
        "name": "Fully Loaded",
        "description": "BASIC: 2 points\tYou now carry 33% more throwables.\nACE: 4 points\tYour total ammo capacity is increased by 25%.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "ammo_specialist",
        "tree": "enforcer"
    },
    "big_game_hunters": {
        "name": "Big Game Hunters",
        "description": "BASIC: 3 points\tEvery 6th enemy you kill will drop an extra ammo box.\nACE: 6 points\tYour ammo pickup rate is increased by an additional 25%.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "ammo_specialist",
        "tree": "enforcer"
    },
    "transporter": {
        "name": "Transporter",
        "description": "BASIC: 1 point\tYou can pack and interact with loot bags 50% faster.\nACE: 3 points\tYou can throw bags 50% further.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "engineer",
        "tree": "technician"
    },
    "daredevil": {
        "name": "Daredevil",
        "description": "BASIC: 2 points\tYou interact with objects 10% faster.\nACE: 4 points\tYou take 35% less damage while interacting with objects.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "engineer",
        "tree": "technician"
    },
    "defense_package": {
        "name": "Defense Package",
        "description": "BASIC: 2 points\tYour sentry guns gain 150% increased health.\nACE: 4 points\tYour sentry guns gain a protective shield.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "engineer",
        "tree": "technician"
    },
    "jack_of_all_trades": {
        "name": "Jack of All Trades",
        "description": "BASIC: 3 points\tYou deploy and interact with all deployable 100% faster.\nACE: 6 points\tYou can now equip a secondary deployable to bring with you. If your deployable is equipped as a secondary deployable, you can only bring half of what you should bring if it was equipped as a primary deployable.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "engineer",
        "tree": "technician",
        "unlocks": [
            { "type": "deployableSecondary", "whenState": 2 }
        ]
    },
    "sentry_nest": {
        "name": "Sentry Nest",
        "description": "BASIC: 3 points\tYou can now carry 1 extra sentry gun.\nACE: 6 points\tThe cost of deploying a sentry gun is reduced by 25%. Your sentry guns also have 50% more ammunition.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "engineer",
        "tree": "technician",
        "unlocks": [
            { "type": "deployableSecondary", "whenState": 2 }
        ]
    },
    "phd_in_engineering": {
        "name": "PHD in Engineering",
        "description": "BASIC: 4 points\tYour sentry guns now have an upgraded motion sensor, allowing them to mark all enemies in a 10m radius and giving them a 100% increase in accuracy.\nACE: 8 points\tYou can now toggle AP rounds on your sentry guns, lowering the rate of fire by 75%, but increasing damage by 250% and allowing it to pierce through enemies and shields.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "engineer",
        "tree": "technician"
    },
    "hardware_expert": {
        "name": "Hardware Expert",
        "description": "BASIC: 1 point\tYou fix drills and saws 25% faster. Decreases trip mine deploy time by 20%. Drills and saws are also silent. Civilians and guards must see the drill or saw in order to become alerted.\nACE: 3 points\tGives your drills and saws a 20% chance to automatically restart after breaking.\nNote: Skill does not affect the OVE9000 saw.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "breacher",
        "tree": "technician"
    },
    "combat_engineering": {
        "name": "Combat Engineering",
        "description": "BASIC: 2 points\tThe radius of your trip mine explosion is increased by 50%.\nACE: 4 points\tYour trip mine damage is increased by 50%.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "breacher",
        "tree": "technician"
    },
    "drill_sawgeant": {
        "name": "Drill Sawgeant",
        "description": "BASIC: 2 points\tYour drill and saw timer is decreased by 15%.\nACE: 4 points\tYour drill and saw timer is decreased by an additional 15%.\nNote: Skill does not affect the OVE9000 saw.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "breacher",
        "tree": "technician"
    },
    "more_firepower": {
        "name": "More Firepower",
        "description": "BASIC: 3 points\tYou gain 2 more shaped charges and 5 more trip mines.\nACE: 6 points\tYou gain 3 more shaped charges and 10 more trip mines.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "breacher",
        "tree": "technician"
    },
    "kickstarter": {
        "name": "Kickstarter",
        "description": "BASIC: 3 points\tYour drills and saws gain an additional 30% chance to automatically restart after breaking.\nACE: 6 points\tEnables the ability to reset a broken drill or saw with a melee attack. The ability has a 50% chance to fix the drill or saw. The ability can only be used once per time the drill or saw is broken.\nNote: Skill does not affect the OVE9000 saw.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "breacher",
        "tree": "technician"
    },
    "fire_trap": {
        "name": "Fire Trap",
        "description": "BASIC: 4 points\tYour trip mines now spread fire around the area of detonation for 20 seconds in a 4 meter diameter.\nACE: 8 points\tIncreases the fire effect duration by 20 seconds and increases the fire effect radius by 50%.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "breacher",
        "tree": "technician"
    },
    "steady_grip": {
        "name": "Steady Grip",
        "description": "BASIC: 1 point\tYour weapons gain 4 stability.\nACE: 3 points\tYour moving recoil penalty is decreased by 20%.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "heavy",
        "tree": "technician"
    },
    "oppressor": {
        "name": "Oppressor",
        "description": "BASIC: 2 points\tYour weapons are 15% more effective at threatening enemies.\nACE: 4 points\tYour weapons are additionally 30% more effective at threatening enemies.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "heavy",
        "tree": "technician"
    },
    "fire_control": {
        "name": "Fire Control",
        "description": "BASIC: 2 points\tYour hipfire spread penalty is decreased by 20%.\nACE: 4 points\tThe longer you hipfire without releasing the trigger, the more stable your LMGs, SMGs and Miniguns become.\nStacks up to a 50% recoil reduction.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "heavy",
        "tree": "technician"
    },
    "sleight_of_hand": {
        "name": "Sleight of Hand",
        "description": "BASIC: 3 points\tYou reload your SMGs and LMGs 20% faster.\nACE: 6 points\tKilling 2 enemies with SMGs, LMGs or Special Weapons set on automatic fire mode will increase your next reload speed by up to 100%. This bonus is reduced by 1% for each bullet above 20 in the total magazine size, down to a 40% reload speed increase.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "heavy",
        "tree": "technician"
    },
    "lock_n_load": {
        "name": "Lock N' Load",
        "description": "BASIC: 3 points\tYou can now hip-fire your weapons while sprinting.\nACE: 6 points\tYou no longer have a movement speed penalty when wielding Heavy Weaponry.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "heavy",
        "tree": "technician"
    },
    "body_expertise": {
        "name": "Body Expertise",
        "description": "BASIC: 4 points\tAll of your ranged weapons can now pierce through enemy body armor.\nDoes not apply to throwable weapons.\nACE: 8 points\t80% of the bonus from headshot damage is permanently applied to hitting enemies on the body.\nThis skill is only activated by SMGs fired in automatic mode, LMGs or Miniguns.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "heavy",
        "tree": "technician"
    },
    "inner_pockets": {
        "name": "Inner Pockets",
        "description": "BASIC: 1 point\tIncreases the concealment of melee weapons by 1.\nACE: 3 points\tIncreases the concealment of all ballistic vests by 3.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "shinobi",
        "tree": "ghost"
    },
    "winston_wolfe": {
        "name": "Winston Wolfe",
        "description": "BASIC: 2 points\tYou gain 1 additional body bag in your inventory. Also increases the body bag inventory space to 3.\nACE: 4 points\tYou lockpick 50% faster.\nYou can now silently crack safes by hand.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "shinobi",
        "tree": "ghost"
    },
    "ecm_feedback": {
        "name": "ECM Feedback",
        "description": "BASIC: 2 points\tYou can now interact with ECM jammers to cause a feedback loop that stuns enemies.\nFeedback loop has a 25m radius.\tObstructed line of sight halves the radius.\nACE: 4 points\tECM feedback now recharges every 2 minutes.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "shinobi",
        "tree": "ghost"
    },
    "chameleon": {
        "name": "Chameleon",
        "description": "BASIC: 3 points\tIncreases the time before you start getting detected by 35% in casing mode.\nYou are 35% less likely to be targeted when you are close to your crew members in loud.\nACE: 6 points\tYour concealment is increased by 5.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "shinobi",
        "tree": "ghost"
    },
    "blackout": {
        "name": "Blackout",
        "description": "BASIC: 4 points\tYou gain the ability to disable 1 camera from detecting you and your crew. Effects last for 25 seconds.\nACE: 8 points\tYour ECM jammer can now also be used to open certain electronic doors. Pagers are delayed by the ECM jammers.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "shinobi",
        "tree": "ghost"
    },
    "ecm_specialist": {
        "name": "ECM Specialist",
        "description": "BASIC: 3 points\tYou can now place 2 ECM jammers instead of just one.\nACE: 6 points\tYour ECM jammer and feedback now last 30 seconds.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "shinobi",
        "tree": "ghost"
    },
    "athlete": {
        "name": "Athlete",
        "description": "BASIC: 1 point\tThe time before stamina regeneration starts is reduced by 25% and the regeneration rate of stamina is increased by 25%.\nACE: 3 points\tYour total movement speed is increased by 10%.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "artful_dodger",
        "tree": "ghost"
    },
    "duck_and_cover": {
        "name": "Duck and Cover",
        "description": "BASIC: 2 points\tThe regeneration rate of your stamina is increased by 33% while crouching.\nACE: 4 points\tYou gain a 10% chance to dodge enemy fire while crouching.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "artful_dodger",
        "tree": "ghost",
        "stats": {
            "basic": [
                {
                    "id": 3,
                    "type": "speed",
                    "part": "speedBonus",
                    "value": 0.10
                }
            ]
        }
    },
    "sprinter": {
        "name": "Sprinter",
        "description": "BASIC: 2 points\tYou can now sprint while strafing and swapping weapons.\nACE: 4 points\tYou gain a 10% chance to dodge enemy fire while sprinting and zip-lining.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "artful_dodger",
        "tree": "ghost"
    },
    "second_wind": {
        "name": "Second Wind",
        "description": "BASIC: 3 points\tWhen your armor breaks, your movement speed is increased by 20% for 5 seconds.\nACE: 6 points\tYou gain a 10% chance to dodge enemy fire when your armor is broken.\nThis cannot occur again for another 10 seconds after your armor regenerates.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "artful_dodger",
        "tree": "ghost"
    },
    "shockproof": {
        "name": "Shockproof",
        "description": "BASIC: 3 points\tWhen tased, the shock effect will be 33% weaker.\nYou no longer randomly pull the trigger while being tased.\nACE: 6 points\tWhen tased, you are able to free yourself from the taser by interacting with it within 2 seconds of getting tased.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "artful_dodger",
        "tree": "ghost"
    },
    "sneaky_bastard": {
        "name": "Sneaky Bastard",
        "description": "BASIC: 4 points\tYou gain a 1% chance to dodge for every 2 points of detection rate under 35 up to 10%.\nACE: 8 points\tWhile your armor is broken, dodging will fully regenerate it.\nThis cannot occur more than once every 10 seconds.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "artful_dodger",
        "tree": "ghost"
    },
    "resilient_assault": {
        "name": "Resilient Assault",
        "description": "BASIC: 1 point\tYou gain 5% critical hit chance.\tCritical hits deal 200% damage.\nACE: 3 points\tWhen your armor breaks, the first shot on every enemy will cause that enemy to stagger.\nThe effect persists for 3 seconds after your armor has recovered.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "specialized_killing",
        "tree": "ghost"
    },
    "eagle_eye": {
        "name": "Eagle Eye",
        "description": "BASIC: 2 points\tYou deal 10% more damage against special enemies.\nACE: 4 points\tYou can now mark specials by aiming down at them with any weapon.\nThe range at which you can manually mark enemies is 4 times longer.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "specialized_killing",
        "tree": "ghost"
    },
    "the_professional": {
        "name": "The Professional",
        "description": "BASIC: 2 points\tYou snap to zoom 25% faster with silenced weapons.\nACE: 4 points\tYou gain 1 concealment for each silenced weapon equipped. Reduce the concealment penalty of silencers by 2.",
        "vr_description": "Addition in VR:\tBASIC: Every kill while aiming down sight will regenerate 2% stamina.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "specialized_killing",
        "tree": "ghost"
    },
    "silent_killer": {
        "name": "Silent Killer",
        "description": "BASIC: 3 points\tYour silenced weapons gain 4 stability and accuracy, as well as a 30% chance to pierce enemy armor.\nACE: 6 points\tYour silenced weapons gain a 15% damage increase.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "specialized_killing",
        "tree": "ghost"
    },
    "high_value_target": {
        "name": "High Value Target",
        "description": "BASIC: 3 points\tEnemies you mark take 20% more damage when farther away than 10 meters.\nACE: 6 points\tEnemies you mark take 30% more damage at all ranges.\tThe marked state duration is increased by 100%.\nNote: This effect is applied separately from the Basic version.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "specialized_killing",
        "tree": "ghost"
    },
	"low_blow": {
		"name": "Low Blow",
		"description": "BASIC: 4 points\tYou gain a 1% critical hit chance for every 2 points of detection rate under 35 up to 10%.\nACE: 8 points\tYou gain an additional 20% critical hit chance.\nCritical hits now deal an additional 100% damage.",
		"basic": 4,
		"ace": 8,
		"tier": 4,
		"subtree": "specialized_killing",
		"tree": "ghost"
	},
    "equilibrium": {
        "name": "Equilibrium",
        "description": "BASIC: 1 point\tDecreases the time it takes to draw end holster pistols by 10%.\nACE: 3 points\tYou gain 8 weapon accuracy with all pistols.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "gunslinger",
        "tree": "fugitive"
    },
    "gun_nut": {
        "name": "Gun Nut",
        "description": "BASIC: 2 points\tYour pistol magazine sizes are increased by 5 bullets.\nACE: 4 points\tYou gain a 50% increased rate of fire with pistols.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "gunslinger",
        "tree": "fugitive"
    },
    "akimbo": {
        "name": "Akimbo",
        "description": "BASIC: 2 points\tYour Akimbo weapons' stability penalty is reduced by 8.\nACE: 4 points\tYour Akimbo weapons' stability penalty is reduced by an additional 8 and they also have 50% increased ammo capacity.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "gunslinger",
        "tree": "fugitive"
    },
    "one_handed_talent": {
        "name": "One Handed Talent",
        "description": "BASIC: 3 points\tThe base damage of all pistols is increased by 5.\nACE: 6 points\tThe base damage of all pistols is increased by an additional 10 damage.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "gunslinger",
        "tree": "fugitive"
    },
    "desperado": {
        "name": "Desperado",
        "description": "BASIC: 3 points\tEach successful pistol hit gives you a 10% accuracy bonus for 10 seconds and you can stack it 4 times.\nACE: 6 points\tYou reload all pistols 50% faster.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "gunslinger",
        "tree": "fugitive"
    },
    "trigger_happy": {
        "name": "Trigger Happy",
        "description": "BASIC: 4 points\tFor every hit with a pistol you gain a 15% damage boost that lasts for 3 seconds.\tStacks up to 5 times.\nACE: 8 points\tYou now gain a 37.5% damage boost for every hit and the damage boost lasts 6 seconds.\tStacks up to 2 times.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "gunslinger",
        "tree": "fugitive"
    },
    "tough_guy": {
        "name": "Tough Guy",
        "description": "BASIC: 1 point\tYou can now use your steelsight while in bleedout.\nACE: 3 points\tYou can now swap your weapons while in bleedout.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "revenant",
        "tree": "fugitive"
    },
    "quick_fix": {
        "name": "Quick Fix",
        "description": "BASIC: 2 points\tDecreases your First Aid Kit and Doctor Bag deploy time by 100%.\nACE: 4 points\tCrew members that use your First Aid Kits or Doctor Bags take 10% less damage for 120 seconds.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "revenant",
        "tree": "fugitive"
    },
    "running_from_death": {
        "name": "Running from Death",
        "description": "BASIC: 2 points\tYou reload and swap weapons 100% faster for 10 seconds after being revived.\nACE: 4 points\tYou move 30% faster for 10 seconds after being revived.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "revenant",
        "tree": "fugitive"
    },
    "uppers": {
        "name": "Uppers",
        "description": "BASIC: 3 points\tUsing a First Aid Kit makes you regenerate 10 health every 5 seconds for 60 seconds.\nACE: 6 points\tYour deployed First Aid Kits will be automatically used if a player is downed within a 5 meter radius of the First Aid Kit. This cannot occur more than once every 120 seconds.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "revenant",
        "tree": "fugitive"
    },
    "swan_song": {
        "name": "Swan Song",
        "description": "BASIC: 3 points\tInstead of getting downed instantly, you gain the ability to keep on fighting for 3 seconds with a 60% movement penalty before going down.\nNote: Does not trigger on fall or fire damage.\nACE: 6 points\tIncreases the duration of Swan Song by 6 seconds.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "revenant",
        "tree": "fugitive"
    },
    "messiah": {
        "name": "Messiah",
        "description": "BASIC: 4 points\tWhile in bleedout, you can revive yourself if you kill an enemy. You only have 1 charge.\nYour bleedout timer is increased by 10 seconds.\nNote: Getting out of custody doesn't replenish the charges.\nACE: 8 points\tYou gain an additional 2 charges.\nWhenever you get into custody, your hostages will trade themselves for your safe return. This effect can occur during assaults, but only 1 time during a heist.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "revenant",
        "tree": "fugitive"
    },
    "martial_arts": {
        "name": "Martial Arts",
        "description": "BASIC: 1 point\tYou take 50% less damage from all melee attacks. Because of training.\nACE: 3 points\tYou are 50% more likely to knock down enemies with a melee strike.",
        "basic": 1,
        "ace": 3,
        "tier": 1,
        "subtree": "brawler",
        "tree": "fugitive"
    },
    "bloodthirst": {
        "name": "Bloodthirst",
        "description": "BASIC: 2 points\tEvery kill you get will increase your next melee attack damage by 100%, up to a maximum of 500%. This effect gets reset when you kill an enemy with a melee attack.\nACE: 4 points\tWhenever you kill an enemy with a melee attack, you will gain a 50% increase in reload speed for 10 seconds.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "brawler",
        "tree": "fugitive"
    },
    "pumping_iron": {
        "name": "Pumping Iron",
        "description": "BASIC: 2 points\tYour melee reswing speed is 100% faster.\nACE: 4 points\tYour melee attacks deal 50% more damage.",
        "basic": 2,
        "ace": 4,
        "tier": 2,
        "subtree": "brawler",
        "tree": "fugitive"
    },
    "counterstrike": {
        "name": "Counterstrike",
        "description": "BASIC: 3 points\tYou can now sprint with melee weapons.\nACE: 6 points\tYou can now knock down bulldozers with melee. This cannot occur more than once every 10 seconds.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "brawler",
        "tree": "fugitive"
    },
    "berserker": {
        "name": "Berserker",
        "description": "BASIC: 3 points\tThe lower your health, the more movement speed you gain. When your health is below 50%, you will gain up to 20% movement speed.\nACE: 6 points\tThe lower your health, the more damage you do. When your health is below 50%, you will do up to 250% more melee and saw damage.",
        "basic": 3,
        "ace": 6,
        "tier": 3,
        "subtree": "brawler",
        "tree": "fugitive"
    },
    "frenzy": {
        "name": "Frenzy",
        "description": "BASIC: 4 points\tYou only get 10% of your maximum health and cannot heal above it but you take 15% less damage and healing received is reduced by 75%.\nACE: 8 points\tDamage taken is now reduced by 35% and healing received is reduced by 0%.",
        "basic": 4,
        "ace": 8,
        "tier": 4,
        "subtree": "brawler",
        "tree": "fugitive",
        "stats": {
            "basic": [
                {
                    "id": 4,
                    "type": "health",
                    "part": "healthFrenzy",
                    "value": -0.9
                }
            ]
        }
    }
}
